nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C2f, [256]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 1, EFAModule, [384]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 3, EFAModule, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, WaveletUnPool, []]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, WaveletUnPool, []]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, WaveletPool, []]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, WaveletPool, []]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
